//
// Created by Banghua Zhao on 26/06/2025
// Copyright Apps Bay Limited. All rights reserved.
//
  

import Foundation

struct HabitIconDataSource {
    static let icons: [HabitCategory: [String]] = [
        .diet: [
            "🫒", "🥑","🥦", "🥕", "🥬", "🥒", "🌽", "🍠", "🍅", "🧄", "🧅", "🍄", "🥗","🍎", "🍓", "🍇", "🍉", "🍌", "🍍", "🍒", "🥭", "🥝", "🫐", "🍊", "🍋", "🍈","🐟", "🦐", "🍗", "🍣", "🥩", "🥚", "🥜", "🌰","🥛","💧","🍵","🧀","🍯", "🫘","🍚", "🍙", "🍘", "🍞", "🥖", "🥐", "🥨", "🍱"],
        .exercise: ["🏃", "🚴", "🏊", "🏋️", "🔩","🏀", "🏐", "🎾", "🏓", "🥊", "🏸", "🥎", "🏌️", "🧘", "🚶‍♂️", "🧍‍♂️", "🧗", "🤸", "🚣", "🏂", "⛸️", "⛳", "🏄", "🥾", "🛹", "🛶", "🤽", "🤿", "🧘‍♂️", "🤼", "🥋", "🤾", "🤺", "🏇", "🏉", "🏹", "🥅", "🪂", "🧊", "🛷", "🪁", "🧍‍♀️", "🪢","🪜"],
        .sleep: ["😴", "💤", "🛌", "🛏️", "🛌‍♂️", "🛌‍♀️", "🌙", "🌜", "🌌", "🌃", "🌠", "😪", "😌","🕕", "🕘", "🌝", "🌞", "⏳","⏰", "🦥", "💊", "🧴", "🛁", "🧸", "🕯️", "🔕", "🧘", "🌧️"],
        .preventiveHealth: [
          "🩺","💉","🏥","🩹","🩻","🦠","🧴","🌡️","💊","🩸","🦷","👁️","👂","🩼","💪","🏋️‍♂️","🧘","🧬","🧪","🧠","🫁","🫀","🦴","🥦","🚰","🛏️","🚭","⚖️","🕶️","🧼","📋","👩‍⚕️", "👨‍⚕️","🤒", "🤕","📵", "☀️"],
        .mentalHealth: [
          "🧘", "😊", "🌿", "📖", "🎶", "🎨", "💆", "💭", "🙏",
          "😇", "💖", "🌸", "🕊️", "🎵", "😌", "🌼", "📝", "🎤", "🎭",
          "💡", "🧠", "🌈", "🙌", "😄", "🌺", "🎉", "🎧", "📚", "💕",
          "😉", "🌻", "🎸", "💃", "🕺", "🎬", "🛀", "🌙", "🕯️", "🤗",
          "🧩", "🛋️", "💤", "☀️", "🌅", "💬", "🧑‍🤝‍🧑", "🤝", "🧍‍♂️", "🏞️"
        ]
    ]
    
    static func getIcons(for category: HabitCategory) -> [String] {
        return icons[category] ?? []
    }
    
    static func getIcon(at index: Int, for category: HabitCategory) -> String? {
        let icons = getIcons(for: category)
        guard index >= 0 && index < icons.count else { return nil }
        return icons[index]
    }
}
